{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Good day",
                "Hey",
                "Hi there",
                "Is anyone there?"
            ],
            "responses": [
                "Hello, how can I assist you today?",
                "Hi! How can I help with your visit to the museum?",
                "Good day! What can I do for you?"
            ],
            "context": [""]
        },
        {"tag": "query",
            "patterns": ["I have a query", "I want to know something", "can you guide me", "I have some doubts", "I am confuse"],
            "responses": ["I will assist you ", "feel free to ask questions", "I will help you"],
            "context": [""]
        },
        {"tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
            "context": [""]
        },
        {"tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me","I was helpful","your work is impressive","your responses are getting better","impressive","your output are impressive"],
            "responses": ["My pleasure", "You're Welcome"],
            "context": [""]
        },
        {"tag": "ask_questionsp",
            "patterns": ["I am good", "I am fine", "I am happy", "I am awesome", "I am very happy","I am feeling good","I am doing good"],
            "responses": ["Great!! How can I help you ?", "Felt happy for you... How can I help you today ?"],
            "context": [""]
        },
        {"tag": "ask_questionsn",
            "patterns": ["I am sad", "I am not happy", "I am not doing good", "I am heartbroken", "I am not feeling good","I am angry","I am hopeless"],
            "responses": ["Okay!! I guess you should engage yourself towards other things so let's start ...Try to visit a museum near you :)"],
            "context": [""]
        },
        {"tag": "negative",
            "patterns": ["It was poor response","you are slow","that was wrong output","it was incorrect","it wasn't correct","you are awful","wrong","you made mistake","Your output is incorrect","your work is slow"],
            "responses": ["I am sorry. But, I am sure that you will not face such difficulty after my new update... Till then please give me another try"],
            "context": [""]
        },

        {
            "tag": "book_ticket",
            "patterns": [
                "ticket booking",
                "ticket book",
                "I want to book a ticket",
                "Can I get tickets?",
                "How do I buy a ticket?",
                "Book a ticket for the museum",
                "Get me a ticket",
                "Reserve a ticket for me",
                "How to reserve tickets?",
                "Where can I purchase a ticket?",
                "I need to buy a ticket",
                "How can I get entry tickets?",
                "I want to reserve my visit",
                "book tickets"
            ],
            "responses": [
                "I'd be happy to assist with purchasing tickets. Just click the link below: \n{link}",
                "Sure, I can help you with that. Please use the link below to buy your tickets: \n{link}",
                "Of course! You can buy your tickets by clicking the link below: \n{link}",
                "Absolutely, I'll help you get those tickets. Click here to proceed: \n{link}",
                "No problem! Just click the link below to purchase your tickets: \n{link}",
                "I'm here to help! Go ahead and click the link to buy your tickets: \n{link}",
                "Certainly! Please follow the link below to secure your tickets: \n{link}",
                "I'll take care of that for you. Click the link to buy your tickets: \n{link}"
            ],
            "context": [""]
        },
        {
            "tag": "cancel_ticket",
            "patterns": [
                "cancel booking",
                "ticket cancelation",
                "Steps to cancel the visit",
                "I want to cancel my tickets",
                "cancel the tickets",
                "I need to cancel my ticket",
                "Can I cancel my booking?",
                "How do I cancel my ticket?",
                "Cancel my ticket please",
                "I want to cancel my museum ticket",
                "cancel the tickets",
                "I want to cancel bookings",
                "cancel tickets",
                "cancel booking"
            ],
            "responses": [
                "Sure, I can help you cancel your ticket. Just click the link below to proceed: \n{link}",
                "I'll assist with the cancellation. Use the link below to start the process: \n{link}",
                "Certainly! You can use the link below to cancel your ticket: \n{link}",
                "No worries, I'll assist with that. Follow the link below to cancel your ticket: \n{link}",
                "Of course! Click the link below to initiate your ticket cancellation: \n{link}",
                "I'm here to help with your cancellation. Simply click the link below: \n{link}",
                "Absolutely, I'll help you out. Please click the link below to cancel your ticket: \n{link}",
                "I'll take care of that for you. Click here to cancel your ticket: \n{link}"
            ],
            "context": [""]
        },
        {
            "tag": "delhi_science_centre",
            "patterns": [
                "tell me about nscm",
                "I want to know about delhi science centre",
                "I want to know about delhi science museum",
                "Tell me about the National Science Centre in Delhi",
                "What can I see at the National Science Centre?",
                "Tell me about Delhi's Science Museum?",
                "Details about National Science museum Delhi",
                "nscm",
                "delhi science museum",
                "tell me about delhi science museum in brief",
                "What's special about the National Science Centre?",
                "Describe the Science Museum in Delhi",
                "What's the history of Delhi's Science Centre?",
                "Where is the National Science Centre located?",
                "What can I learn at Delhi's Science Centre?"
            ],
            "responses": [
                "The National Science Centre in Delhi is one of the largest and most popular science museums in India. Located in the Pragati Maidan area, it is part of the National Council of Science Museums (NCSM) and serves as a hub for science education and popularization.",
                "The National Science Centre established in 1992, is a science museum in Delhi, India. It is part of the National Council of Science Museums (NCSM), an autonomous body under India's Ministry of Culture. It stands close to Gate no 1, of Pragati Maidan overlooking the Purana Qila.",
                "The National Science Centre in Delhi is a prominent museum that offers an engaging experience with a wide array of science and technology exhibits, making it an ideal destination for visitors of all ages. Located near Pragati Maidan, it is easily accessible via the Supreme Court/Pragati Maidan metro station."
            ],
            "context": [""]
        },
        {
            "tag": "char_of_delhi_science_museum",
            "patterns": [

                "I want to know about attractions of delhi science museum",
                "Tell me about attractions of delhi science museum",
                "What to expect at the Delhi Science Centre?",
                "What are the characteristics of delhi science museum",
                "What special events happen at delhi science museum",
                "give me information for nscm tourist attraction",
                "what to do at nscm or in delhi science museum",
                "Features of delhi science museum",
                "features of nscm",
                "What exhibits are in the Delhi Science Museum?",
                "What are the major highlights of the National Science Centre?",
                "What are the top things to see at Delhi’s Science Centre?",
                "What kind of events can I attend at the Delhi Science Museum?",
                "What interactive exhibits are available at the National Science Centre?"

            ],
            "responses": [
                "Some of the major attractions include the Energy Ball, Science on Sphere, 3D Film Show, and the Biotech Lab. The centre also features interactive exhibits, an aquarium, and an Innovation Hub for hands-on science activities.",
                "1. Exhibits and Galleries: The center boasts several permanent galleries, each dedicated to different aspects of science and technology. Some of the prominent galleries include:\n\tHeritage Gallery: Showcases India's contributions to science and technology throughout history.\n\tFun Science Gallery: Interactive exhibits that make learning science fun for visitors of all ages.\n\tHuman Biology Gallery: Focuses on the human body, its anatomy, and physiological processes.\n\tPrehistoric Life Gallery: Explores the evolution of life on Earth, from the prehistoric era to modern times.\n\tInformation Revolution Gallery: Highlights the advancements in communication technology and the digital age.\n2. Interactive Exhibits: The center is known for its hands-on exhibits, which encourage visitors, especially children, to engage with scientific concepts in a practical and enjoyable manner.\n3. Science Shows and Demonstrations: Regular live science shows, demonstrations, and workshops are conducted to further engage visitors. These cover topics ranging from physics and chemistry to environmental science.\n4. 3D and Science on a Sphere: The center also features a 3D theater and a 'Science on a Sphere' exhibit, where spherical projections create an immersive experience for learning about Earth and space.\n5. Temporary Exhibitions: In addition to the permanent galleries, the National Science Centre also hosts temporary exhibitions on various contemporary science topics.\n6. Educational Programs: The center conducts numerous educational programs, including science camps, teacher training workshops, and competitions for students.\n7. Planetarium: Although not part of the National Science Centre itself, the nearby Nehru Planetarium complements the center's educational offerings, providing an immersive experience in astronomy.",
                "Be a part of the science fairs to nurture your creative and research-based skills. The Science Fairs are conducted to draw the attention of the young crowd who are good in mathematics/science or interested in taking their career ahead in engineering.\nAttend the sky-watching sessions in the Sky Observation Camp and experience what it feels like to observe the various constellations along with eclipses, meteor showers, and other celestial bodies through the telescope at night.\nEnjoy the various science shows organized by the center on an everyday basis for school students as well as for the general audience. These kinds of shows are designed to make science learning fun and interesting. Some of the popular topics a demonstrator explains are Kitchen Chemistry, Super Cold Show, Sound Show, etc.\nCelebrate important days like National Technology Day, World Health Day, World Population Day, Engineer’s Day, World Environment Day, World Telecommunication Day, and World Health Day at the National Science Centre to increase your knowledge about the commemorative days. Not only do these celebrations raise awareness among people but also encourage them to invite others as well."
            ],
            "context": [""]
        },
        {
            "tag": "Ticket",
            "patterns": [
                "tickets",
                "what is ticket price?",
                "What are segregation of ticket price?",
                "ticket price",
                "tell me about tickets",
                "tickets per head",
                "what is ticket price for science museum delhi"
                
            ],
            "responses": [
                "The entry fee to visit the National Science Centre in Delhi is INR 70 per person for general people. In case you're traveling in a group of more than 25 people, you'll need to pay INR 60 per head. For students from organized school groups, the charges are INR 25 per head and for government school goers, it costs INR 10 per head."
            ],
            "context": [""]
        },
        {
            "tag": "Timings",
            "patterns": [
                "I want to know about timings",
                "what is timing for visit?",
                "when delhi science museum opens?",
                "when delhi science museum closes",
                "what are timings for delhi science museum",
                "timing",
                "timming"
            ],
            "responses": [
                "The timings for delhi science museum is from 9.30 am to 6.00pm everyday. Museum might close because of public holidays and festivals please refer for latest news article for the same."
            ],
            "context": [""]
        },
        {
            "tag": "how_to_reach",
            "patterns": [
                "how to reach there",
                "how can I reach to museum?",
                "directions for museum",
                "what are the ways to reach museum",
                "tell me about the methods to reach delhi science museum",
                "nearest metro",
                "near metro station"
            ],
            "responses": [
                "In Delhi, there are several modes of transportation available for people of all ages. Depending on your holiday style and budget, you can choose from the following 3 options:\nBy Metro: Take a direct metro from the Indira Gandhi International Airport to Rajiv Chowk and then another metro from Rajiv Chowk to Pragati Maidan. After reaching there, you can enjoy a short stroll as it is only 1.2 km away.\nBy Bus: Another convenient way is via a local bus. Catch a state-owned bus outside the airport to reach your desired destination at pocket-friendly prices. For your ease, many private buses are also available at the airport for tourists to roam around and explore the popular sightseeing places in Delhi.\nBy Cab: Lastly, if you're looking for extra comfort, choose to hire a rental taxi from Ola/Uber or simply go ahead with a private cab from the list of top car rental companies in Delhi. The National Science Centre is approximately 15 km away from the airport and it will take nearly 25 to 30 minutes to cover the required distance by cab."
            ],
            "context": [""]
        },
        {
            "tag": "parking_availability",
            "patterns": [
                "Is there parking available?",
                "Can I park at the National Science Centre?",
                "Are there parking facilities at the science center?",
                "Where can I park near the Delhi Science Centre?"
            ],
            "responses": [
                "Yes, parking facilities are available at the centre, but it's recommended to arrive early to secure a spot, especially on weekends."
            ]
        },
        {
            "tag": "nearby_attractions",
            "patterns": [
                "places nearby",
                "near by place",
                "What places can I visit nearby?",
                "Attractions close to the National Science Centre",
                "Places to see around the Science Centre",
                "tell me about nearby attractions",
                "nearby special things"
            ],
            "responses": [
                "Nearby attractions include India Gate, the National Zoological Park, the National Rail Museum, and Purana Qila. These spots offer a mix of historical and cultural experiences."
            ]
        },
        {
            "tag": "contact_info",
            "patterns": [
                "How can I contact the National Science Centre?",
                "What's the contact number?",
                "Contact details for the Science Centre"
            ],
            "responses": [
                "You can contact the National Science Centre, Delhi, at their official phone number +91-11-2337-1703 or via email at nscd@nscd.gov.in."
            ]
        },
        {
        "tag": "namaskar",
            "patterns": [
                "Koi hai?",
                "kaise ho",
                "kya haal hai",
                "kya waha hai koi"
            ],
            "responses": [
                "Namaste, mai aapki kaise madad kar sakta hoon?",
                "Kaise ho aap! Museum ghumne mein main aapki kaise madad kar sakta hoon?",
                "Namaskar! Main aapke liye kya kar sakta hoon?"
            ],
            "context": [""]
        },
        {
            "tag": "prashan",
            "patterns": [
                "Mujhe ek sawaal poochhna hai",
                "Mujhe kuch jaan'na hai",
                "Kya aap mujhe guide kar sakte hain?",
                "Mujhe kuch doubts hain",
                "Main confuse hoon",
                "Mai kuch puchna chahta hu",
                "Mai duvidha mai hu"
            ],
            "responses": [
                "Aap bejhijak sawal poocho Main aapki madad karunga",
                "Sawaal poochne mai sankoch naa kare",
                "Beshak Main aapki madad karoonga",
                "Mujhe aapki madad karne mai khushi hogi"
            ],
            "context": [""]
        },
        {
            "tag": "alvida",
            "patterns": [
                "Appa Phir milenge",
                "Alvida",
                "Aap se baat karke acha laga, dhanyavad",
                "Agli baar tak ke liye"
            ],
            "responses": [
                "Phir milenge!",
                "Aapka din shubh ho",
                "Bye! Jaldi phir aaiyega.",
                "Mai aapki madad kar paaya mujhe iss baat ki khushi hai"
            ],
            "context": [""]
        },
        {
            "tag": "shukriya",
            "patterns": [
                "Shukriya",
                "Dhanyavad",
                "Yeh bahut madadgar tha",
                "Awesome, shukriya",
                "Madad karne ke liye shukriya",
                "Aapne meri bahut madad ki",
                "Aapka kaam impressive hai",
                "Aapke responses better ho rahe hain",
                "Impressive",
                "Aapke output impressive hain"
            ],
            "responses": [
                "Mera sukh",
                "Aapka swagat hai",
                "Mujhe khushi hui yee jaanke ki mai aapki madad kar paya"
            ],
            "context": [""]
        },
        {
            "tag": "prashan_uttar_positive",
            "patterns": [
                "Main accha hoon",
                "Main theek hoon",
                "Main khush hoon",
                "Main awesome hoon",
                "Main bahut khush hoon",
                "Main achha mehsoos kar raha hoon",
                "Main achha kar raha hoon"
            ],
            "responses": [
                "Great!! Main aapki kaise madad kar sakta hoon?",
                "Aapke liye khushi hui... Aaj main aapki madad kaise kar sakta hoon?"
            ],
            "context": [""]
        },
        {
            "tag": "prashan_uttar_negative",
            "patterns": [
                "Main udaas hoon",
                "Main khush nahi hoon",
                "Mujhe achaa nahi lag raha hai",
                "Main accha mehsus nahi kar raha hoon",
                "Mera dil toota hua hai",
                "Main gussa hoon",
                "Main niraash hoon"
            ],
            "responses": [
                "Thik hai!! Main samajhta hoon, aapko apne man ko dusri cheezon mein lagana chahiye. Chaliye shuru karte hain... Koshish karo apne nazdeek ek museum visit karo :)"
            ],
            "context": [""]
        },
        {
            "tag": "nakaratmak",
            "patterns": [
                "Yeh poor response tha",
                "Aap slow hain",
                "Woh galat output tha",
                "Yeh incorrect tha",
                "Yeh sahi nahi tha",
                "Aap awful hain",
                "Galat",
                "Aapne galti ki",
                "Aapka output incorrect hai",
                "Aapka kaam slow hai"
            ],
            "responses": [
                "Mujhe maaf kariye. Lekin, main aasha karta hoon ki mere naye update ke baad aapko aisi pareshani nahi hogi... Tab tak, mujhe ek aur mauka dein"
            ],
            "context": [""]
        },
        {
            "tag": "parchi_kaatna",
            "patterns": [
                "Ticket book karo",
                "Main ticket book karna chahta hoon",
                "Kya main tickets le sakta hoon?",
                "Main ticket kaise khareedoon?",
                "Museum ke liye ticket book karo",
                "Mujhe ek ticket chahiye",
                "Mere liye ticket reserve karo",
                "Tickets kaise reserve karoon?",
                "Main ticket kahaan se khareed sakta hoon?",
                "Mujhe ticket khareedni hai",
                "Entry tickets kaise milengi?",
                "Main apne visit ko reserve karna chahta hoon",
                "Mujhe Tickets book karne mai sahita chahiye"
            ],
            "responses": [
                "Main khushi se aapko tickets khareedne mein madad karoonga. Neeche diye gaye link par click karein: \n{link}",
                "Zaroor, main aapki madad kar sakta hoon. Tickets khareedne ke liye neeche diye gaye link ka istemal karein: \n{link}",
                "Bilkul! Aap neeche diye gaye link par click karke apne tickets khareed sakte hain: \n{link}",
                "Bilkul, main aapke liye tickets lene mai sahita kar sakta hu. Aage badhne ke liye yahan click karein: \n{link}",
                "Koi problem nahi! Tickets khareedne ke liye neeche diye gaye link par click karein: \n{link}",
                "Main yahaan hoon madad ke liye! Tickets khareedne ke liye neeche diye gaye link par click karein: \n{link}",
                "Zaroor! Neeche diye gaye link ka palan karein apne tickets secure karne ke liye: \n{link}",
                "Main uska dhyan rakh loonga. Tickets khareedne ke liye neeche diye gaye link par click karein: \n{link}"
            ],
            "context": [""]
        },
        {
            "tag": "ticket_rad_karna",
            "patterns": [
                "Booking cancel karo",
                "Visit cancel karne ke steps",
                "Main apne tickets cancel karna chahta hoon",
                "Tickets cancel karo",
                "Mujhe apna ticket cancel karna hai",
                "Kya main apni booking cancel kar sakta hoon?",
                "Main apna ticket kaise cancel karoon?",
                "Mera ticket cancel karo please",
                "Main apna museum ticket cancel karna chahta hoon",
                "Tickets cancel karo",
                "Main bookings cancel karna chahta hoon",
                "Tickets cancel karo",
                "Booking cancel karo",
                "vigyan bhawan ki ticket cancel karo ",
                "vigyan bhawan ki ticket radd karne mai meri sahaiyata karo"
            ],
            "responses": [
                "Zaroor, main aapke ticket cancel karne mein madad kar sakta hoon. Aage badhne ke liye neeche diye gaye link par click karein: \n{link}",
                "Main aapki madad karoonga cancellation mein. Process shuru karne ke liye neeche diye gaye link ka palan karein: \n{link}",
                "Zaroor! Aap apne ticket cancel karne ke liye neeche diye gaye link ka istemal kar sakte hain: \n{link}",
                "Koi chinta nahi, main uska dhyan rakh loonga. Ticket cancel karne ke liye neeche diye gaye link par click karein: \n{link}",
                "Bilkul! Apne ticket cancellation shuru karne ke liye neeche diye gaye link par click karein: \n{link}",
                "Main yahaan hoon aapki madad karne ke liye. Simple click karein neeche diye gaye link par: \n{link}",
                "Bilkul, main aapki madad kar loonga. Ticket cancel karne ke liye neeche diye gaye link par click karein: \n{link}",
                "Main uska dhyan rakh loonga. Ticket cancel karne ke liye yahan click karein: \n{link}"
            ],
            "context": [""]
        },
        {
            "tag": "delhi_vigyan_bhandar",
            "patterns": [
                "Mujhe nscm ke baare mein batao",
                "Main delhi science centre ke baare mein jaan'na chahta hoon",
                "Main delhi science museum ke baare mein jaan'na chahta hoon",
                "Mujhe National Science Centre, Delhi ke baare mein batao",
                "Main National Science Centre mein kya dekh sakta hoon?",
                "Mujhe Delhi ke Science Museum ke baare mein batao?",
                "Mujhe National Science museum Delhi ke details batao",
                "Mujhe delhi science museum ke baare mein jaankari chahiye",
                "Delhi science museum ke baare mein short mein batao",
                "National Science Centre mein kya khaas hai?",
                "Delhi ke Science Museum ke baare mein batao",
                "Delhi Science Centre ki history kya hai?",
                "National Science Centre kahan sith hai?",
                "Main Delhi ke Science Centre mein kya seekh sakta hoon?",
                "vigyan bhawan ki ticket book karo"
            ],
            "responses": [
                "National Science Centre, Delhi, ek zabardast science museum hai jo aapko science aur technology ke vishay mein prabhavit karne wala experience dega. Aapko yahaan par alag-alag exhibits aur displays milenge jo scientific concepts aur innovations ko dikhate hain. Yeh centre Pragati Maidan, New Delhi mein sthit hai. Aapko yahaan par interactive exhibits, planetarium shows, aur bahut kuch dekhne ko milega!"
            ],
            "context": [""]
        },
        {
            "tag": "delhi_science_museum_khasiyat",
            "patterns": [
                "Mujhe Delhi Science Museum ke aakarshan ke baare mein batao",
                "Delhi Science Museum ke attractions ke baare mein batao",
                "Delhi Science Centre mein kya ummid kar sakta hoon?",
                "Delhi Science Museum ki khasiyat kya hain?",
                "Delhi Science Museum mein kaunse khaas events hote hain?",
                "NSCM ke paryatakon ke aakarshan ke baare mein information do",
                "NSCM ya Delhi Science Museum mein kya karna hai?",
                "Delhi Science Museum ke features kya hain?",
                "NSCM ki khasiyat kya hain?",
                "Delhi Science Museum mein kaunse exhibits hain?",
                "National Science Centre ke major highlights kya hain?",
                "Delhi ke Science Centre mein dekhne layak cheezein kya hain?",
                "Delhi Science Museum mein kaunse events attend kar sakta hoon?",
                "National Science Centre mein kaunse interactive exhibits available hain?"
            ],
            "responses": [
                "Kuch major attractions mein Energy Ball, Science on Sphere, 3D Film Show, aur Biotech Lab shamil hain. Centre mein interactive exhibits, ek aquarium, aur hands-on science activities ke liye ek Innovation Hub bhi hai.",
                "1. Exhibits aur Galleries: Center mein kai permanent galleries hain, har ek science aur technology ke alag-alag aspects ko dedicated hai. Kuch prominent galleries mein shamil hain:\n\tHeritage Gallery: Jo Bharat ke science aur technology mein yogdan ko dikhata hai.\n\tFun Science Gallery: Interactive exhibits jo har umr ke visitors ke liye science seekhne ko mazedar banate hain.\n\tHuman Biology Gallery: Jo human body, uski anatomy, aur physiological processes par focus karta hai.\n\tPrehistoric Life Gallery: Earth par life ke evolution ko dikhata hai, prehistoric era se lekar modern times tak.\n\tInformation Revolution Gallery: Communication technology aur digital age ke advancements ko highlight karta hai.\n2. Interactive Exhibits: Center hands-on exhibits ke liye jaana jaata hai, jo visitors ko, khaaskar bachchon ko, scientific concepts mein engage karte hain practical aur enjoyable tareeke se.\n3. Science Shows aur Demonstrations: Regular live science shows, demonstrations, aur workshops organize ki jaati hain jo visitors ko aur engage karte hain. Yeh topics jaise physics, chemistry, aur environmental science par cover karte hain.\n4. 3D aur Science on a Sphere: Center mein ek 3D theater aur 'Science on a Sphere' exhibit bhi hai, jahan spherical projections Earth aur space ke baare mein immersive learning experience create karte hain.\n5. Temporary Exhibitions: Permanent galleries ke alawa, National Science Centre mein alag-alag contemporary science topics par temporary exhibitions bhi host ki jaati hain.\n6. Educational Programs: Center kai educational programs conduct karta hai, jisme science camps, teacher training workshops, aur students ke liye competitions shamil hain.\n7. Planetarium: National Science Centre ke paas hi Nehru Planetarium hai jo center ke educational offerings ko complement karta hai, astronomy mein immersive experience provide karta hai.",
                "Science Fairs ka hissa baniye apne creative aur research-based skills ko nurture karne ke liye. Science Fairs young crowd ko attract karte hain jo mathematics/science mein achhe hain ya engineering mein apna career banana chahte hain.\nSky-watching sessions mein shamil ho Sky Observation Camp mein aur anubhav karein ki telescope se raat mein constellations, eclipses, meteor showers, aur doosre celestial bodies ko dekhne ka maza kya hai.\nHar din centre mein school students aur general audience ke liye organize hone wale alag-alag science shows ka anand lijiye. Yeh shows science learning ko fun aur interesting banane ke liye design kiye jaate hain. Kuch popular topics jo ek demonstrator explain karta hai, unmein Kitchen Chemistry, Super Cold Show, Sound Show, etc. shamil hain.\nImportant days jaise National Technology Day, World Health Day, World Population Day, Engineer’s Day, World Environment Day, World Telecommunication Day, aur World Health Day ko National Science Centre mein manaiye taaki aapko inn dinon ke commemorative mahine ka pata chale. Yeh celebrations logon mein awareness badhate hain aur unhe invite karne ke liye encourage bhi karte hain."
            ],
            "context": [""]
        },
        {
            "tag": "parchi",
            "patterns": [
                "parchi",
                "ticket ka price kya hai?",
                "ticket price ka segregation kya hai?",
                "parchi ka mulya",
                "tickets ke baare mein batao",
                "parchi mathe par",
                "parchi kitne ki hai",
                "ticket kitne ki hai",
                "science museum delhi ke liye ticket ka price kya hai?"
            ],
            "responses": [
                "National Science Centre, Delhi visit karne ke liye entry fee general public ke liye INR 70 per person hai. Agar aap 25 se zyada logon ke group mein travel kar rahe hain, toh aapko INR 60 per head dena hoga. Organized school groups se aane wale students ke liye charges INR 25 per head hain aur government school ke students ke liye INR 10 per head hain."
            ],
            "context": [""]
        },
        {
            "tag": "samay",
            "patterns": [
                "Mujhe timings ke baare mein jaana hai",
                "Visit karne ke timing kya hai?",
                "Delhi Science Museum kab khulta hai?",
                "Delhi Science Museum kab band hota hai?",
                "Delhi Science Museum ke timings kya hain?",
                "samay",
                "Delhi Science Museum kis samay khulta hai"
            ],
            "responses": [
                "Delhi Science Museum ke timings har roz 9:30 am se 6:00 pm tak hain. Museum public holidays aur festivals ke wajah se band ho sakta hai, iske liye latest news article refer karein."
            ],
            "context": [""]
        },
        {
            "tag": "pahuchna_kaise_hai",
            "patterns": [
                "Wahan kaise pahunchna hai?",
                "Main museum kaise pahunch sakta hoon?",
                "Museum ke liye directions kya hain?",
                "Museum pahunchne ke liye kya tareeke hain?",
                "Delhi Science Museum pahunchne ke methods ke baare mein batao",
                "sabse pass wali metro",
                "Museum kee pas konsa metro station hai"
            ],
            "responses": [
                "Delhi mein har umr ke logon ke liye kai tareeke ke transportation available hain. Apne holiday style aur budget ke hisaab se, aap inme se 3 options chun sakte hain:\nBy Metro: Indira Gandhi International Airport se Rajiv Chowk ke liye direct metro lein aur phir Rajiv Chowk se Pragati Maidan ke liye doosri metro lein. Wahan pahunchne ke baad, aap thoda walk kar sakte hain kyunki yeh sirf 1.2 km doori par hai.\nBy Bus: Ek aur convenient tareeka local bus ke zariye hai. Airport ke bahar se ek state-owned bus pakdiye apne desired destination par pocket-friendly prices mein pahunchne ke liye. Aapki suvidha ke liye, kai private buses bhi airport par available hain jo tourists ke liye dilli ke popular sightseeing places explore karne mein madad karti hain.\nBy Cab: Lastly, agar aap extra comfort chahte hain, toh Ola/Uber se ek rental taxi hire karein ya simply Delhi ke top car rental companies ke list se ek private cab chun lein. National Science Centre approximately airport se 15 km doori par hai aur yeh lagbhag 25 se 30 minutes lagenge yeh distance cab se cover karne mein."
            ],
            "context": [""]
        },
        {
            "tag": "parking_hai",
            "patterns": [
                "Kya wahan parking available hai?",
                "Parking ki suvidha hai kya?",
                "Kya main National Science Centre par park kar sakta hoon?",
                "Science center par parking ki suvidha hain?",
                "Delhi Science Centre ke paas kahaan park kar sakta hoon?"
            ],
            "responses": [
                "Haan, centre par parking facilities available hain, lekin weekend par spot secure karne ke liye jaldi pahunchna recommend kiya jaata hai."
            ],
            "context": [""]
        },
        {
            "tag": "aas_paas_ki_aakarshan",
            "patterns": [
                "Paas mein dekhne layak jagah kaunsi hain?",
                "Aas paas koi achi jagah hai?",
                "Paas mein kaunse places visit kar sakta hoon?",
                "National Science Centre ke paas kaunse attractions hain?",
                "Science Centre ke aas-paas kya dekhne layak hain?",
                "Nearby attractions ke baare mein batao",
                "Paas mein special cheezein"
            ],
            "responses": [
                "Nearby attractions mein India Gate, National Zoological Park, National Rail Museum, aur Purana Qila shamil hain. Yeh jagah historical aur cultural experiences ka mix offer karti hain."
            ],
            "context": [""]
        },
        {
            "tag": "sampark_kare",
            "patterns": [
                "Main National Science Centre se kaise contact kar sakta hoon?",
                "Sampark karne ke liye kya karna hoga?",
                "Science Centre ke liye contact details"
            ],
            "responses": [
                "Aap National Science Centre, Delhi se unke official phone number +91-11-2337-1703 par sampark kar sakte hai ya phir aap nscd@nscd.gov.in par email kar sakte hai"
            ]
        }
    ]
}